GopalSaraf/Practicals/PSDL/include/proc/pic18f47j53.inc
// Generated 09/02/2023 GMT

/*
 * Copyright © 2023, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18F47J53_INC_
#define _PIC18F47J53_INC_

/*
 * Assembly Header file for the Microchip PIC Microcontroller
 * PIC18F47J53
 */

/*
 * Device Registers
 */

// Register: ADCTRIG
#define ADCTRIG ADCTRIG
ADCTRIG                                  equ 0EB8h
// bitfield definitions
ADCTRIG_TRIGSEL_POSN                     equ 0000h
ADCTRIG_TRIGSEL_POSITION                 equ 0000h
ADCTRIG_TRIGSEL_SIZE                     equ 0002h
ADCTRIG_TRIGSEL_LENGTH                   equ 0002h
ADCTRIG_TRIGSEL_MASK                     equ 0003h
ADCTRIG_SRC0_POSN                        equ 0000h
ADCTRIG_SRC0_POSITION                    equ 0000h
ADCTRIG_SRC0_SIZE                        equ 0001h
ADCTRIG_SRC0_LENGTH                      equ 0001h
ADCTRIG_SRC0_MASK                        equ 0001h
ADCTRIG_SRC1_POSN                        equ 0001h
ADCTRIG_SRC1_POSITION                    equ 0001h
ADCTRIG_SRC1_SIZE                        equ 0001h
ADCTRIG_SRC1_LENGTH                      equ 0001h
ADCTRIG_SRC1_MASK                        equ 0002h
ADCTRIG_TRIGSEL0_POSN                    equ 0000h
ADCTRIG_TRIGSEL0_POSITION                equ 0000h
ADCTRIG_TRIGSEL0_SIZE                    equ 0001h
ADCTRIG_TRIGSEL0_LENGTH                  equ 0001h
ADCTRIG_TRIGSEL0_MASK                    equ 0001h
ADCTRIG_TRIGSEL1_POSN                    equ 0001h
ADCTRIG_TRIGSEL1_POSITION                equ 0001h
ADCTRIG_TRIGSEL1_SIZE                    equ 0001h
ADCTRIG_TRIGSEL1_LENGTH                  equ 0001h
ADCTRIG_TRIGSEL1_MASK                    equ 0002h
ADCTRIG_SRC_POSN                         equ 0000h
ADCTRIG_SRC_POSITION                     equ 0000h
ADCTRIG_SRC_SIZE                         equ 0002h
ADCTRIG_SRC_LENGTH                       equ 0002h
ADCTRIG_SRC_MASK                         equ 0003h

// Register: PMDIS0
#define PMDIS0 PMDIS0
PMDIS0                                   equ 0EB9h
// bitfield definitions
PMDIS0_ADCMD_POSN                        equ 0000h
PMDIS0_ADCMD_POSITION                    equ 0000h
PMDIS0_ADCMD_SIZE                        equ 0001h
PMDIS0_ADCMD_LENGTH                      equ 0001h
PMDIS0_ADCMD_MASK                        equ 0001h
PMDIS0_SPI1MD_POSN                       equ 0001h
PMDIS0_SPI1MD_POSITION                   equ 0001h
PMDIS0_SPI1MD_SIZE                       equ 0001h
PMDIS0_SPI1MD_LENGTH                     equ 0001h
PMDIS0_SPI1MD_MASK                       equ 0002h
PMDIS0_SPI2MD_POSN                       equ 0002h
PMDIS0_SPI2MD_POSITION                   equ 0002h
PMDIS0_SPI2MD_SIZE                       equ 0001h
PMDIS0_SPI2MD_LENGTH                     equ 0001h
PMDIS0_SPI2MD_MASK                       equ 0004h
PMDIS0_UART1MD_POSN                      equ 0003h
PMDIS0_UART1MD_POSITION                  equ 0003h
PMDIS0_UART1MD_SIZE                      equ 0001h
PMDIS0_UART1MD_LENGTH                    equ 0001h
PMDIS0_UART1MD_MASK                      equ 0008h
PMDIS0_UART2MD_POSN                      equ 0004h
PMDIS0_UART2MD_POSITION                  equ 0004h
PMDIS0_UART2MD_SIZE                      equ 0001h
PMDIS0_UART2MD_LENGTH                    equ 0001h
PMDIS0_UART2MD_MASK                      equ 0010h
PMDIS0_ECCP1MD_POSN                      equ 0005h
PMDIS0_ECCP1MD_POSITION                  equ 0005h
PMDIS0_ECCP1MD_SIZE                      equ 0001h
PMDIS0_ECCP1MD_LENGTH                    equ 0001h
PMDIS0_ECCP1MD_MASK                      equ 0020h
PMDIS0_ECCP2MD_POSN                      equ 0006h
PMDIS0_ECCP2MD_POSITION                  equ 0006h
PMDIS0_ECCP2MD_SIZE                      equ 0001h
PMDIS0_ECCP2MD_LENGTH                    equ 0001h
PMDIS0_ECCP2MD_MASK                      equ 0040h
PMDIS0_ECCP3MD_POSN                      equ 0007h
PMDIS0_ECCP3MD_POSITION                  equ 0007h
PMDIS0_ECCP3MD_SIZE                      equ 0001h
PMDIS0_ECCP3MD_LENGTH                    equ 0001h
PMDIS0_ECCP3MD_MASK                      equ 0080h
PMDIS0_PMDMSSP1_POSN                     equ 0001h
PMDIS0_PMDMSSP1_POSITION                 equ 0001h
PMDIS0_PMDMSSP1_SIZE                     equ 0001h
PMDIS0_PMDMSSP1_LENGTH                   equ 0001h
PMDIS0_PMDMSSP1_MASK                     equ 0002h
PMDIS0_PMDMSSP2_POSN                     equ 0002h
PMDIS0_PMDMSSP2_POSITION                 equ 0002h
PMDIS0_PMDMSSP2_SIZE                     equ 0001h
PMDIS0_PMDMSSP2_LENGTH                   equ 0001h
PMDIS0_PMDMSSP2_MASK                     equ 0004h
PMDIS0_PMDUART1_POSN                     equ 0003h
PMDIS0_PMDUART1_POSITION                 equ 0003h
PMDIS0_PMDUART1_SIZE                     equ 0001h
PMDIS0_PMDUART1_LENGTH                   equ 0001h
PMDIS0_PMDUART1_MASK                     equ 0008h
PMDIS0_PMDUART2_POSN                     equ 0004h
PMDIS0_PMDUART2_POSITION                 equ 0004h
PMDIS0_PMDUART2_SIZE                     equ 0001h
PMDIS0_PMDUART2_LENGTH                   equ 0001h
PMDIS0_PMDUART2_MASK                     equ 0010h
PMDIS0_PMDECCP1_POSN                     equ 0005h
PMDIS0_PMDECCP1_POSITION                 equ 0005h
PMDIS0_PMDECCP1_SIZE                     equ 0001h
PMDIS0_PMDECCP1_LENGTH                   equ 0001h
PMDIS0_PMDECCP1_MASK                     equ 0020h
PMDIS0_PMDECCP2_POSN                     equ 0006h
PMDIS0_PMDECCP2_POSITION                 equ 0006h
PMDIS0_PMDECCP2_SIZE                     equ 0001h
PMDIS0_PMDECCP2_LENGTH                   equ 0001h
PMDIS0_PMDECCP2_MASK                     equ 0040h
PMDIS0_PMDECCP3_POSN                     equ 0007h
PMDIS0_PMDECCP3_POSITION                 equ 0007h
PMDIS0_PMDECCP3_SIZE                     equ 0001h
PMDIS0_PMDECCP3_LENGTH                   equ 0001h
PMDIS0_PMDECCP3_MASK                     equ 0080h
PMDIS0_PMDADC_POSN                       equ 0000h
PMDIS0_PMDADC_POSITION                   equ 0000h
PMDIS0_PMDADC_SIZE                       equ 0001h
PMDIS0_PMDADC_LENGTH                     equ 0001h
PMDIS0_PMDADC_MASK                       equ 0001h
PMDIS0_PMDMSSP_POSN                      equ 0001h
PMDIS0_PMDMSSP_POSITION                  equ 0001h
PMDIS0_PMDMSSP_SIZE                      equ 0002h
PMDIS0_PMDMSSP_LENGTH                    equ 0002h
PMDIS0_PMDMSSP_MASK                      equ 0006h
PMDIS0_PMDUART_POSN                      equ 0003h
PMDIS0_PMDUART_POSITION                  equ 0003h
PMDIS0_PMDUART_SIZE                      equ 0002h
PMDIS0_PMDUART_LENGTH                    equ 0002h
PMDIS0_PMDUART_MASK                      equ 0018h
PMDIS0_PMDECCP_POSN                      equ 0005h
PMDIS0_PMDECCP_POSITION                  equ 0005h
PMDIS0_PMDECCP_SIZE                      equ 0003h
PMDIS0_PMDECCP_LENGTH                    equ 0003h
PMDIS0_PMDECCP_MASK                      equ 00E0h
PMDIS0_SPIMD_POSN                        equ 0001h
PMDIS0_SPIMD_POSITION                    equ 0001h
PMDIS0_SPIMD_SIZE                        equ 0002h
PMDIS0_SPIMD_LENGTH                      equ 0002h
PMDIS0_SPIMD_MASK                        equ 0006h
PMDIS0_UARTMD_POSN                       equ 0003h
PMDIS0_UARTMD_POSITION                   equ 0003h
PMDIS0_UARTMD_SIZE                       equ 0002h
PMDIS0_UARTMD_LENGTH                     equ 0002h
PMDIS0_UARTMD_MASK                       equ 0018h
PMDIS0_ECCPMD_POSN                       equ 0005h
PMDIS0_ECCPMD_POSITION                   equ 0005h
PMDIS0_ECCPMD_SIZE                       equ 0003h
PMDIS0_ECCPMD_LENGTH                     equ 0003h
PMDIS0_ECCPMD_MASK                       equ 00E0h

// Register: PMDIS1
#define PMDIS1 PMDIS1
PMDIS1                                   equ 0EBAh
// bitfield definitions
PMDIS1_TMR1MD_POSN                       equ 0001h
PMDIS1_TMR1MD_POSITION                   equ 0001h
PMDIS1_TMR1MD_SIZE                       equ 0001h
PMDIS1_TMR1MD_LENGTH                     equ 0001h
PMDIS1_TMR1MD_MASK                       equ 0002h
PMDIS1_TMR2MD_POSN                       equ 0002h
PMDIS1_TMR2MD_POSITION                   equ 0002h
PMDIS1_TMR2MD_SIZE                       equ 0001h
PMDIS1_TMR2MD_LENGTH                     equ 0001h
PMDIS1_TMR2MD_MASK                       equ 0004h
PMDIS1_TMR3MD_POSN                       equ 0003h
PMDIS1_TMR3MD_POSITION                   equ 0003h
PMDIS1_TMR3MD_SIZE                       equ 0001h
PMDIS1_TMR3MD_LENGTH                     equ 0001h
PMDIS1_TMR3MD_MASK                       equ 0008h
PMDIS1_TMR4MD_POSN                       equ 0004h
PMDIS1_TMR4MD_POSITION                   equ 0004h
PMDIS1_TMR4MD_SIZE                       equ 0001h
PMDIS1_TMR4MD_LENGTH                     equ 0001h
PMDIS1_TMR4MD_MASK                       equ 0010h
PMDIS1_RTCCMD_POSN                       equ 0005h
PMDIS1_RTCCMD_POSITION                   equ 0005h
PMDIS1_RTCCMD_SIZE                       equ 0001h
PMDIS1_RTCCMD_LENGTH                     equ 0001h
PMDIS1_RTCCMD_MASK                       equ 0020h
PMDIS1_CTMUMD_POSN                       equ 0006h
PMDIS1_CTMUMD_POSITION                   equ 0006h
PMDIS1_CTMUMD_SIZE                       equ 0001h
PMDIS1_CTMUMD_LENGTH                     equ 0001h
PMDIS1_CTMUMD_MASK                       equ 0040h
PMDIS1_PSPMD_POSN                        equ 0007h
PMDIS1_PSPMD_POSITION                    equ 0007h
PMDIS1_PSPMD_SIZE                        equ 0001h
PMDIS1_PSPMD_LENGTH                      equ 0001h
PMDIS1_PSPMD_MASK                        equ 0080h
PMDIS1_PMDTMR1_POSN                      equ 0001h
PMDIS1_PMDTMR1_POSITION                  equ 0001h
PMDIS1_PMDTMR1_SIZE                      equ 0001h
PMDIS1_PMDTMR1_LENGTH                    equ 0001h
PMDIS1_PMDTMR1_MASK                      equ 0002h
PMDIS1_PMDTMR2_POSN                      equ 0002h
PMDIS1_PMDTMR2_POSITION                  equ 0002h
PMDIS1_PMDTMR2_SIZE                      equ 0001h
PMDIS1_PMDTMR2_LENGTH                    equ 0001h
PMDIS1_PMDTMR2_MASK                      equ 0004h
PMDIS1_PMDTMR3_POSN                      equ 0003h
PMDIS1_PMDTMR3_POSITION                  equ 0003h
PMDIS1_PMDTMR3_SIZE                      equ 0001h
PMDIS1_PMDTMR3_LENGTH                    equ 0001h
PMDIS1_PMDTMR3_MASK                      equ 0008h
PMDIS1_PMDTMR4_POSN                      equ 0004h
PMDIS1_PMDTMR4_POSITION                  equ 0004h
PMDIS1_PMDTMR4_SIZE                      equ 0001h
PMDIS1_PMDTMR4_LENGTH                    equ 0001h
PMDIS1_PMDTMR4_MASK                      equ 0010h
PMDIS1_PMDTMR_POSN                       equ 0001h
PMDIS1_PMDTMR_POSITION                   equ 0001h
PMDIS1_PMDTMR_SIZE                       equ 0004h
PMDIS1_PMDTMR_LENGTH                     equ 0004h
PMDIS1_PMDTMR_MASK                       equ 001Eh
PMDIS1_PMDRTCC_POSN                      equ 0005h
PMDIS1_PMDRTCC_POSITION                  equ 0005h
PMDIS1_PMDRTCC_SIZE                      equ 0001h
PMDIS1_PMDRTCC_LENGTH                    equ 0001h
PMDIS1_PMDRTCC_MASK                      equ 0020h
PMDIS1_PMDCTMU_POSN                      equ 0006h
PMDIS1_PMDCTMU_POSITION                  equ 0006h
PMDIS1_PMDCTMU_SIZE                      equ 0001h
PMDIS1_PMDCTMU_LENGTH                    equ 0001h
PMDIS1_PMDCTMU_MASK                      equ 0040h
PMDIS1_PMDPSP_POSN                       equ 0007h
PMDIS1_PMDPSP_POSITION                   equ 0007h
PMDIS1_PMDPSP_SIZE                       equ 0001h
PMDIS1_PMDPSP_LENGTH                     equ 0001h
PMDIS1_PMDPSP_MASK                       equ 0080h
PMDIS1_TMRMD_POSN                        equ 0001h
PMDIS1_TMRMD_POSITION                    equ 0001h
PMDIS1_TMRMD_SIZE                        equ 0004h
PMDIS1_TMRMD_LENGTH                      equ 0004h
PMDIS1_TMRMD_MASK                        equ 001Eh

// Register: PMDIS2
#define PMDIS2 PMDIS2
PMDIS2                                   equ 0EBBh
// bitfield definitions
PMDIS2_CMP1MD_POSN                       equ 0000h
PMDIS2_CMP1MD_POSITION                   equ 0000h
PMDIS2_CMP1MD_SIZE                       equ 0001h
PMDIS2_CMP1MD_LENGTH                     equ 0001h
PMDIS2_CMP1MD_MASK                       equ 0001h
PMDIS2_CMP2MD_POSN                       equ 0001h
PMDIS2_CMP2MD_POSITION                   equ 0001h
PMDIS2_CMP2MD_SIZE                       equ 0001h
PMDIS2_CMP2MD_LENGTH                     equ 0001h
PMDIS2_CMP2MD_MASK                       equ 0002h
PMDIS2_CMP3MD_POSN                       equ 0002h
PMDIS2_CMP3MD_POSITION                   equ 0002h
PMDIS2_CMP3MD_SIZE                       equ 0001h
PMDIS2_CMP3MD_LENGTH                     equ 0001h
PMDIS2_CMP3MD_MASK                       equ 0004h
PMDIS2_TMR5MD_POSN                       equ 0003h
PMDIS2_TMR5MD_POSITION                   equ 0003h
PMDIS2_TMR5MD_SIZE                       equ 0001h
PMDIS2_TMR5MD_LENGTH                     equ 0001h
PMDIS2_TMR5MD_MASK                       equ 0008h
PMDIS2_TMR6MD_POSN                       equ 0004h
PMDIS2_TMR6MD_POSITION                   equ 0004h
PMDIS2_TMR6MD_SIZE                       equ 0001h
PMDIS2_TMR6MD_LENGTH                     equ 0001h
PMDIS2_TMR6MD_MASK                       equ 0010h
PMDIS2_TMR8MD_POSN                       equ 0006h
PMDIS2_TMR8MD_POSITION                   equ 0006h
PMDIS2_TMR8MD_SIZE                       equ 0001h
PMDIS2_TMR8MD_LENGTH                     equ 0001h
PMDIS2_TMR8MD_MASK                       equ 0040h
PMDIS2_PMDCMP1_POSN                      equ 0000h
PMDIS2_PMDCMP1_POSITION                  equ 0000h
PMDIS2_PMDCMP1_SIZE                      equ 0001h
PMDIS2_PMDCMP1_LENGTH                    equ 0001h
PMDIS2_PMDCMP1_MASK                      equ 0001h
PMDIS2_PMDCMP2_POSN                      equ 0001h
PMDIS2_PMDCMP2_POSITION                  equ 0001h
PMDIS2_PMDCMP2_SIZE                      equ 0001h
PMDIS2_PMDCMP2_LENGTH                    equ 0001h
PMDIS2_PMDCMP2_MASK                      equ 0002h
PMDIS2_PMDCMP3_POSN                      equ 0002h
PMDIS2_PMDCMP3_POSITION                  equ 0002h
PMDIS2_PMDCMP3_SIZE                      equ 0001h
PMDIS2_PMDCMP3_LENGTH                    equ 0001h
PMDIS2_PMDCMP3_MASK                      equ 0004h
PMDIS2_PMDCMP_POSN                       equ 0000h
PMDIS2_PMDCMP_POSITION                   equ 0000h
PMDIS2_PMDCMP_SIZE                       equ 0003h
PMDIS2_PMDCMP_LENGTH                     equ 0003h
PMDIS2_PMDCMP_MASK                       equ 0007h
PMDIS2_PMDTMR5_POSN                      equ 0003h
PMDIS2_PMDTMR5_POSITION                  equ 0003h
PMDIS2_PMDTMR5_SIZE                      equ 0001h
PMDIS2_PMDTMR5_LENGTH                    equ 0001h
PMDIS2_PMDTMR5_MASK                      equ 0008h
PMDIS2_PMDTMR6_POSN                      equ 0004h
PMDIS2_PMDTMR6_POSITION                  equ 0004h
PMDIS2_PMDTMR6_SIZE                      equ 0001h
PMDIS2_PMDTMR6_LENGTH                    equ 0001h
PMDIS2_PMDTMR6_MASK                      equ 0010h
PMDIS2_PMDTMR8_POSN                      equ 0006h
PMDIS2_PMDTMR8_POSITION                  equ 0006h
PMDIS2_PMDTMR8_SIZE                      equ 0001h
PMDIS2_PMDTMR8_LENGTH                    equ 0001h
PMDIS2_PMDTMR8_MASK                      equ 0040h
PMDIS2_CMPMD_POSN                        equ 0000h
PMDIS2_CMPMD_POSITION                    equ 0000h
PMDIS2_CMPMD_SIZE                        equ 0003h
PMDIS2_CMPMD_LENGTH                      equ 0003h
PMDIS2_CMPMD_MASK                        equ 0007h

// Register: PMDIS3
#define PMDIS3 PMDIS3
PMDIS3                                   equ 0EBCh
// bitfield definitions
PMDIS3_CCP4MD_POSN                       equ 0001h
PMDIS3_CCP4MD_POSITION                   equ 0001h
PMDIS3_CCP4MD_SIZE                       equ 0001h
PMDIS3_CCP4MD_LENGTH                     equ 0001h
PMDIS3_CCP4MD_MASK                       equ 0002h
PMDIS3_CCP5MD_POSN                       equ 0002h
PMDIS3_CCP5MD_POSITION                   equ 0002h
PMDIS3_CCP5MD_SIZE                       equ 0001h
PMDIS3_CCP5MD_LENGTH                     equ 0001h
PMDIS3_CCP5MD_MASK                       equ 0004h
PMDIS3_CCP6MD_POSN                       equ 0003h
PMDIS3_CCP6MD_POSITION                   equ 0003h
PMDIS3_CCP6MD_SIZE                       equ 0001h
PMDIS3_CCP6MD_LENGTH                     equ 0001h
PMDIS3_CCP6MD_MASK                       equ 0008h
PMDIS3_CCP7MD_POSN                       equ 0004h
PMDIS3_CCP7MD_POSITION                   equ 0004h
PMDIS3_CCP7MD_SIZE                       equ 0001h
PMDIS3_CCP7MD_LENGTH                     equ 0001h
PMDIS3_CCP7MD_MASK                       equ 0010h
PMDIS3_CCP8MD_POSN                       equ 0005h
PMDIS3_CCP8MD_POSITION                   equ 0005h
PMDIS3_CCP8MD_SIZE                       equ 0001h
PMDIS3_CCP8MD_LENGTH                     equ 0001h
PMDIS3_CCP8MD_MASK                       equ 0020h
PMDIS3_CCP9MD_POSN                       equ 0006h
PMDIS3_CCP9MD_POSITION                   equ 0006h
PMDIS3_CCP9MD_SIZE                       equ 0001h
PMDIS3_CCP9MD_LENGTH                     equ 0001h
PMDIS3_CCP9MD_MASK                       equ 0040h
PMDIS3_CCP10MD_POSN                      equ 0007h
PMDIS3_CCP10MD_POSITION                  equ 0007h
PMDIS3_CCP10MD_SIZE                      equ 0001h
PMDIS3_CCP10MD_LENGTH                    equ 0001h
PMDIS3_CCP10MD_MASK                      equ 0080h
PMDIS3_PMDCCP4_POSN                      equ 0001h
PMDIS3_PMDCCP4_POSITION                  equ 0001h
PMDIS3_PMDCCP4_SIZE                      equ 0001h
PMDIS3_PMDCCP4_LENGTH                    equ 0001h
PMDIS3_PMDCCP4_MASK                      equ 0002h
PMDIS3_PMDCCP5_POSN                      equ 0002h
PMDIS3_PMDCCP5_POSITION                  equ 0002h
PMDIS3_PMDCCP5_SIZE                      equ 0001h
PMDIS3_PMDCCP5_LENGTH                    equ 0001h
PMDIS3_PMDCCP5_MASK                      equ 0004h
PMDIS3_PMDCCP6_POSN                      equ 0003h
PMDIS3_PMDCCP6_POSITION                  equ 0003h
PMDIS3_PMDCCP6_SIZE                      equ 0001h
PMDIS3_PMDCCP6_LENGTH                    equ 0001h
PMDIS3_PMDCCP6_MASK                      equ 0008h
PMDIS3_PMDCCP7_POSN                      equ 0004h
PMDIS3_PMDCCP7_POSITION                  equ 0004h
PMDIS3_PMDCCP7_SIZE                      equ 0001h
PMDIS3_PMDCCP7_LENGTH                    equ 0001h
PMDIS3_PMDCCP7_MASK                      equ 0010h
PMDIS3_PMDCCP8_POSN                      equ 0005h
PMDIS3_PMDCCP8_POSITION                  equ 0005h
PMDIS3_PMDCCP8_SIZE                      equ 0001h
PMDIS3_PMDCCP8_LENGTH                    equ 0001h
PMDIS3_PMDCCP8_MASK                      equ 0020h
PMDIS3_PMDCCP9_POSN                      equ 0006h
PMDIS3_PMDCCP9_POSITION                  equ 0006h
PMDIS3_PMDCCP9_SIZE                      equ 0001h
PMDIS3_PMDCCP9_LENGTH                    equ 0001h
PMDIS3_PMDCCP9_MASK                      equ 0040h
PMDIS3_PMDCCP10_POSN                     equ 0007h
PMDIS3_PMDCCP10_POSITION                 equ 0007h
PMDIS3_PMDCCP10_SIZE                     equ 0001h
PMDIS3_PMDCCP10_LENGTH                   equ 0001h
PMDIS3_PMDCCP10_MASK                     equ 0080h
PMDIS3_PMDCCP_POSN                       equ 0001h
PMDIS3_PMDCCP_POSITION                   equ 0001h
PMDIS3_PMDCCP_SIZE                       equ 0007h
PMDIS3_PMDCCP_LENGTH                     equ 0007h
PMDIS3_PMDCCP_MASK                       equ 00FEh
PMDIS3_CCPMD_POSN                        equ 0001h
PMDIS3_CCPMD_POSITION                    equ 0001h
PMDIS3_CCPMD_SIZE                        equ 0007h
PMDIS3_CCPMD_LENGTH                      equ 0007h
PMDIS3_CCPMD_MASK                        equ 00FEh

