GopalSaraf/Practicals/PSDL/include/proc/pic18f47j53.inc
// Register: CCPR7L
#define CCPR7L CCPR7L
CCPR7L                                   equ 0F0Ah
// bitfield definitions
CCPR7L_CCPR7L_POSN                       equ 0000h
CCPR7L_CCPR7L_POSITION                   equ 0000h
CCPR7L_CCPR7L_SIZE                       equ 0008h
CCPR7L_CCPR7L_LENGTH                     equ 0008h
CCPR7L_CCPR7L_MASK                       equ 00FFh

// Register: CCPR7H
#define CCPR7H CCPR7H
CCPR7H                                   equ 0F0Bh
// bitfield definitions
CCPR7H_CCPR7H_POSN                       equ 0000h
CCPR7H_CCPR7H_POSITION                   equ 0000h
CCPR7H_CCPR7H_SIZE                       equ 0008h
CCPR7H_CCPR7H_LENGTH                     equ 0008h
CCPR7H_CCPR7H_MASK                       equ 00FFh

// Register: CCP6CON
#define CCP6CON CCP6CON
CCP6CON                                  equ 0F0Ch
// bitfield definitions
CCP6CON_CCP6M_POSN                       equ 0000h
CCP6CON_CCP6M_POSITION                   equ 0000h
CCP6CON_CCP6M_SIZE                       equ 0004h
CCP6CON_CCP6M_LENGTH                     equ 0004h
CCP6CON_CCP6M_MASK                       equ 000Fh
CCP6CON_DC6B_POSN                        equ 0004h
CCP6CON_DC6B_POSITION                    equ 0004h
CCP6CON_DC6B_SIZE                        equ 0002h
CCP6CON_DC6B_LENGTH                      equ 0002h
CCP6CON_DC6B_MASK                        equ 0030h
CCP6CON_CCP6M0_POSN                      equ 0000h
CCP6CON_CCP6M0_POSITION                  equ 0000h
CCP6CON_CCP6M0_SIZE                      equ 0001h
CCP6CON_CCP6M0_LENGTH                    equ 0001h
CCP6CON_CCP6M0_MASK                      equ 0001h
CCP6CON_CCP6M1_POSN                      equ 0001h
CCP6CON_CCP6M1_POSITION                  equ 0001h
CCP6CON_CCP6M1_SIZE                      equ 0001h
CCP6CON_CCP6M1_LENGTH                    equ 0001h
CCP6CON_CCP6M1_MASK                      equ 0002h
CCP6CON_CCP6M2_POSN                      equ 0002h
CCP6CON_CCP6M2_POSITION                  equ 0002h
CCP6CON_CCP6M2_SIZE                      equ 0001h
CCP6CON_CCP6M2_LENGTH                    equ 0001h
CCP6CON_CCP6M2_MASK                      equ 0004h
CCP6CON_CCP6M3_POSN                      equ 0003h
CCP6CON_CCP6M3_POSITION                  equ 0003h
CCP6CON_CCP6M3_SIZE                      equ 0001h
CCP6CON_CCP6M3_LENGTH                    equ 0001h
CCP6CON_CCP6M3_MASK                      equ 0008h
CCP6CON_DC6B0_POSN                       equ 0004h
CCP6CON_DC6B0_POSITION                   equ 0004h
CCP6CON_DC6B0_SIZE                       equ 0001h
CCP6CON_DC6B0_LENGTH                     equ 0001h
CCP6CON_DC6B0_MASK                       equ 0010h
CCP6CON_DC6B1_POSN                       equ 0005h
CCP6CON_DC6B1_POSITION                   equ 0005h
CCP6CON_DC6B1_SIZE                       equ 0001h
CCP6CON_DC6B1_LENGTH                     equ 0001h
CCP6CON_DC6B1_MASK                       equ 0020h

// Register: CCPR6L
#define CCPR6L CCPR6L
CCPR6L                                   equ 0F0Dh
// bitfield definitions
CCPR6L_CCPR6L_POSN                       equ 0000h
CCPR6L_CCPR6L_POSITION                   equ 0000h
CCPR6L_CCPR6L_SIZE                       equ 0008h
CCPR6L_CCPR6L_LENGTH                     equ 0008h
CCPR6L_CCPR6L_MASK                       equ 00FFh

// Register: CCPR6H
#define CCPR6H CCPR6H
CCPR6H                                   equ 0F0Eh
// bitfield definitions
CCPR6H_CCPR6H_POSN                       equ 0000h
CCPR6H_CCPR6H_POSITION                   equ 0000h
CCPR6H_CCPR6H_SIZE                       equ 0008h
CCPR6H_CCPR6H_LENGTH                     equ 0008h
CCPR6H_CCPR6H_MASK                       equ 00FFh

// Register: CCP5CON
#define CCP5CON CCP5CON
CCP5CON                                  equ 0F0Fh
// bitfield definitions
CCP5CON_CCP5M_POSN                       equ 0000h
CCP5CON_CCP5M_POSITION                   equ 0000h
CCP5CON_CCP5M_SIZE                       equ 0004h
CCP5CON_CCP5M_LENGTH                     equ 0004h
CCP5CON_CCP5M_MASK                       equ 000Fh
CCP5CON_DC5B_POSN                        equ 0004h
CCP5CON_DC5B_POSITION                    equ 0004h
CCP5CON_DC5B_SIZE                        equ 0002h
CCP5CON_DC5B_LENGTH                      equ 0002h
CCP5CON_DC5B_MASK                        equ 0030h
CCP5CON_CCP5M0_POSN                      equ 0000h
CCP5CON_CCP5M0_POSITION                  equ 0000h
CCP5CON_CCP5M0_SIZE                      equ 0001h
CCP5CON_CCP5M0_LENGTH                    equ 0001h
CCP5CON_CCP5M0_MASK                      equ 0001h
CCP5CON_CCP5M1_POSN                      equ 0001h
CCP5CON_CCP5M1_POSITION                  equ 0001h
CCP5CON_CCP5M1_SIZE                      equ 0001h
CCP5CON_CCP5M1_LENGTH                    equ 0001h
CCP5CON_CCP5M1_MASK                      equ 0002h
CCP5CON_CCP5M2_POSN                      equ 0002h
CCP5CON_CCP5M2_POSITION                  equ 0002h
CCP5CON_CCP5M2_SIZE                      equ 0001h
CCP5CON_CCP5M2_LENGTH                    equ 0001h
CCP5CON_CCP5M2_MASK                      equ 0004h
CCP5CON_CCP5M3_POSN                      equ 0003h
CCP5CON_CCP5M3_POSITION                  equ 0003h
CCP5CON_CCP5M3_SIZE                      equ 0001h
CCP5CON_CCP5M3_LENGTH                    equ 0001h
CCP5CON_CCP5M3_MASK                      equ 0008h
CCP5CON_DC5B0_POSN                       equ 0004h
CCP5CON_DC5B0_POSITION                   equ 0004h
CCP5CON_DC5B0_SIZE                       equ 0001h
CCP5CON_DC5B0_LENGTH                     equ 0001h
CCP5CON_DC5B0_MASK                       equ 0010h
CCP5CON_DC5B1_POSN                       equ 0005h
CCP5CON_DC5B1_POSITION                   equ 0005h
CCP5CON_DC5B1_SIZE                       equ 0001h
CCP5CON_DC5B1_LENGTH                     equ 0001h
CCP5CON_DC5B1_MASK                       equ 0020h

// Register: CCPR5L
#define CCPR5L CCPR5L
CCPR5L                                   equ 0F10h
// bitfield definitions
CCPR5L_CCPR5L_POSN                       equ 0000h
CCPR5L_CCPR5L_POSITION                   equ 0000h
CCPR5L_CCPR5L_SIZE                       equ 0008h
CCPR5L_CCPR5L_LENGTH                     equ 0008h
CCPR5L_CCPR5L_MASK                       equ 00FFh

// Register: CCPR5H
#define CCPR5H CCPR5H
CCPR5H                                   equ 0F11h
// bitfield definitions
CCPR5H_CCPR5H_POSN                       equ 0000h
CCPR5H_CCPR5H_POSITION                   equ 0000h
CCPR5H_CCPR5H_SIZE                       equ 0008h
CCPR5H_CCPR5H_LENGTH                     equ 0008h
CCPR5H_CCPR5H_MASK                       equ 00FFh

// Register: CCP4CON
#define CCP4CON CCP4CON
CCP4CON                                  equ 0F12h
// bitfield definitions
CCP4CON_CCP4M_POSN                       equ 0000h
CCP4CON_CCP4M_POSITION                   equ 0000h
CCP4CON_CCP4M_SIZE                       equ 0004h
CCP4CON_CCP4M_LENGTH                     equ 0004h
CCP4CON_CCP4M_MASK                       equ 000Fh
CCP4CON_DC4B_POSN                        equ 0004h
CCP4CON_DC4B_POSITION                    equ 0004h
CCP4CON_DC4B_SIZE                        equ 0002h
CCP4CON_DC4B_LENGTH                      equ 0002h
CCP4CON_DC4B_MASK                        equ 0030h
CCP4CON_CCP4M0_POSN                      equ 0000h
CCP4CON_CCP4M0_POSITION                  equ 0000h
CCP4CON_CCP4M0_SIZE                      equ 0001h
CCP4CON_CCP4M0_LENGTH                    equ 0001h
CCP4CON_CCP4M0_MASK                      equ 0001h
CCP4CON_CCP4M1_POSN                      equ 0001h
CCP4CON_CCP4M1_POSITION                  equ 0001h
CCP4CON_CCP4M1_SIZE                      equ 0001h
CCP4CON_CCP4M1_LENGTH                    equ 0001h
CCP4CON_CCP4M1_MASK                      equ 0002h
CCP4CON_CCP4M2_POSN                      equ 0002h
CCP4CON_CCP4M2_POSITION                  equ 0002h
CCP4CON_CCP4M2_SIZE                      equ 0001h
CCP4CON_CCP4M2_LENGTH                    equ 0001h
CCP4CON_CCP4M2_MASK                      equ 0004h
CCP4CON_CCP4M3_POSN                      equ 0003h
CCP4CON_CCP4M3_POSITION                  equ 0003h
CCP4CON_CCP4M3_SIZE                      equ 0001h
CCP4CON_CCP4M3_LENGTH                    equ 0001h
CCP4CON_CCP4M3_MASK                      equ 0008h
CCP4CON_DC4B0_POSN                       equ 0004h
CCP4CON_DC4B0_POSITION                   equ 0004h
CCP4CON_DC4B0_SIZE                       equ 0001h
CCP4CON_DC4B0_LENGTH                     equ 0001h
CCP4CON_DC4B0_MASK                       equ 0010h
CCP4CON_DC4B1_POSN                       equ 0005h
CCP4CON_DC4B1_POSITION                   equ 0005h
CCP4CON_DC4B1_SIZE                       equ 0001h
CCP4CON_DC4B1_LENGTH                     equ 0001h
CCP4CON_DC4B1_MASK                       equ 0020h

// Register: CCPR4L
#define CCPR4L CCPR4L
CCPR4L                                   equ 0F13h
// bitfield definitions
CCPR4L_CCPR4L_POSN                       equ 0000h
CCPR4L_CCPR4L_POSITION                   equ 0000h
CCPR4L_CCPR4L_SIZE                       equ 0008h
CCPR4L_CCPR4L_LENGTH                     equ 0008h
CCPR4L_CCPR4L_MASK                       equ 00FFh

// Register: CCPR4H
#define CCPR4H CCPR4H
CCPR4H                                   equ 0F14h
// bitfield definitions
CCPR4H_CCPR4H_POSN                       equ 0000h
CCPR4H_CCPR4H_POSITION                   equ 0000h
CCPR4H_CCPR4H_SIZE                       equ 0008h
CCPR4H_CCPR4H_LENGTH                     equ 0008h
CCPR4H_CCPR4H_MASK                       equ 00FFh

