GopalSaraf/Practicals/PSDL/include/proc/pic18f47j53.inc
// Register: DSWAKEL
#define DSWAKEL DSWAKEL
DSWAKEL                                  equ 0F4Ah
// bitfield definitions
DSWAKEL_DSPOR_POSN                       equ 0000h
DSWAKEL_DSPOR_POSITION                   equ 0000h
DSWAKEL_DSPOR_SIZE                       equ 0001h
DSWAKEL_DSPOR_LENGTH                     equ 0001h
DSWAKEL_DSPOR_MASK                       equ 0001h
DSWAKEL_DSMCLR_POSN                      equ 0002h
DSWAKEL_DSMCLR_POSITION                  equ 0002h
DSWAKEL_DSMCLR_SIZE                      equ 0001h
DSWAKEL_DSMCLR_LENGTH                    equ 0001h
DSWAKEL_DSMCLR_MASK                      equ 0004h
DSWAKEL_DSRTC_POSN                       equ 0003h
DSWAKEL_DSRTC_POSITION                   equ 0003h
DSWAKEL_DSRTC_SIZE                       equ 0001h
DSWAKEL_DSRTC_LENGTH                     equ 0001h
DSWAKEL_DSRTC_MASK                       equ 0008h
DSWAKEL_DSWDT_POSN                       equ 0004h
DSWAKEL_DSWDT_POSITION                   equ 0004h
DSWAKEL_DSWDT_SIZE                       equ 0001h
DSWAKEL_DSWDT_LENGTH                     equ 0001h
DSWAKEL_DSWDT_MASK                       equ 0010h
DSWAKEL_DSULP_POSN                       equ 0005h
DSWAKEL_DSULP_POSITION                   equ 0005h
DSWAKEL_DSULP_SIZE                       equ 0001h
DSWAKEL_DSULP_LENGTH                     equ 0001h
DSWAKEL_DSULP_MASK                       equ 0020h
DSWAKEL_DSFLT_POSN                       equ 0007h
DSWAKEL_DSFLT_POSITION                   equ 0007h
DSWAKEL_DSFLT_SIZE                       equ 0001h
DSWAKEL_DSFLT_LENGTH                     equ 0001h
DSWAKEL_DSFLT_MASK                       equ 0080h

// Register: DSWAKEH
#define DSWAKEH DSWAKEH
DSWAKEH                                  equ 0F4Bh
// bitfield definitions
DSWAKEH_DSINT0_POSN                      equ 0000h
DSWAKEH_DSINT0_POSITION                  equ 0000h
DSWAKEH_DSINT0_SIZE                      equ 0001h
DSWAKEH_DSINT0_LENGTH                    equ 0001h
DSWAKEH_DSINT0_MASK                      equ 0001h

// Register: DSCONL
#define DSCONL DSCONL
DSCONL                                   equ 0F4Ch
// bitfield definitions
DSCONL_RELEASE_POSN                      equ 0000h
DSCONL_RELEASE_POSITION                  equ 0000h
DSCONL_RELEASE_SIZE                      equ 0001h
DSCONL_RELEASE_LENGTH                    equ 0001h
DSCONL_RELEASE_MASK                      equ 0001h
DSCONL_DSBOR_POSN                        equ 0001h
DSCONL_DSBOR_POSITION                    equ 0001h
DSCONL_DSBOR_SIZE                        equ 0001h
DSCONL_DSBOR_LENGTH                      equ 0001h
DSCONL_DSBOR_MASK                        equ 0002h
DSCONL_ULPWDIS_POSN                      equ 0002h
DSCONL_ULPWDIS_POSITION                  equ 0002h
DSCONL_ULPWDIS_SIZE                      equ 0001h
DSCONL_ULPWDIS_LENGTH                    equ 0001h
DSCONL_ULPWDIS_MASK                      equ 0004h

// Register: DSCONH
#define DSCONH DSCONH
DSCONH                                   equ 0F4Dh
// bitfield definitions
DSCONH_RTCWDIS_POSN                      equ 0000h
DSCONH_RTCWDIS_POSITION                  equ 0000h
DSCONH_RTCWDIS_SIZE                      equ 0001h
DSCONH_RTCWDIS_LENGTH                    equ 0001h
DSCONH_RTCWDIS_MASK                      equ 0001h
DSCONH_DSULPEN_POSN                      equ 0001h
DSCONH_DSULPEN_POSITION                  equ 0001h
DSCONH_DSULPEN_SIZE                      equ 0001h
DSCONH_DSULPEN_LENGTH                    equ 0001h
DSCONH_DSULPEN_MASK                      equ 0002h
DSCONH_DSEN_POSN                         equ 0007h
DSCONH_DSEN_POSITION                     equ 0007h
DSCONH_DSEN_SIZE                         equ 0001h
DSCONH_DSEN_LENGTH                       equ 0001h
DSCONH_DSEN_MASK                         equ 0080h

// Register: DSGPR0
#define DSGPR0 DSGPR0
DSGPR0                                   equ 0F4Eh
// bitfield definitions
DSGPR0_DSGPR0_POSN                       equ 0000h
DSGPR0_DSGPR0_POSITION                   equ 0000h
DSGPR0_DSGPR0_SIZE                       equ 0008h
DSGPR0_DSGPR0_LENGTH                     equ 0008h
DSGPR0_DSGPR0_MASK                       equ 00FFh

// Register: DSGPR1
#define DSGPR1 DSGPR1
DSGPR1                                   equ 0F4Fh
// bitfield definitions
DSGPR1_DSGPR1_POSN                       equ 0000h
DSGPR1_DSGPR1_POSITION                   equ 0000h
DSGPR1_DSGPR1_SIZE                       equ 0008h
DSGPR1_DSGPR1_LENGTH                     equ 0008h
DSGPR1_DSGPR1_MASK                       equ 00FFh

// Register: CCPTMRS2
#define CCPTMRS2 CCPTMRS2
CCPTMRS2                                 equ 0F50h
// bitfield definitions
CCPTMRS2_C8TSEL_POSN                     equ 0000h
CCPTMRS2_C8TSEL_POSITION                 equ 0000h
CCPTMRS2_C8TSEL_SIZE                     equ 0002h
CCPTMRS2_C8TSEL_LENGTH                   equ 0002h
CCPTMRS2_C8TSEL_MASK                     equ 0003h
CCPTMRS2_C9TSEL0_POSN                    equ 0002h
CCPTMRS2_C9TSEL0_POSITION                equ 0002h
CCPTMRS2_C9TSEL0_SIZE                    equ 0001h
CCPTMRS2_C9TSEL0_LENGTH                  equ 0001h
CCPTMRS2_C9TSEL0_MASK                    equ 0004h
CCPTMRS2_C10TSEL0_POSN                   equ 0004h
CCPTMRS2_C10TSEL0_POSITION               equ 0004h
CCPTMRS2_C10TSEL0_SIZE                   equ 0001h
CCPTMRS2_C10TSEL0_LENGTH                 equ 0001h
CCPTMRS2_C10TSEL0_MASK                   equ 0010h
CCPTMRS2_C8TSEL0_POSN                    equ 0000h
CCPTMRS2_C8TSEL0_POSITION                equ 0000h
CCPTMRS2_C8TSEL0_SIZE                    equ 0001h
CCPTMRS2_C8TSEL0_LENGTH                  equ 0001h
CCPTMRS2_C8TSEL0_MASK                    equ 0001h
CCPTMRS2_C8TSEL1_POSN                    equ 0001h
CCPTMRS2_C8TSEL1_POSITION                equ 0001h
CCPTMRS2_C8TSEL1_SIZE                    equ 0001h
CCPTMRS2_C8TSEL1_LENGTH                  equ 0001h
CCPTMRS2_C8TSEL1_MASK                    equ 0002h

// Register: CCPTMRS1
#define CCPTMRS1 CCPTMRS1
CCPTMRS1                                 equ 0F51h
// bitfield definitions
CCPTMRS1_C4TSEL_POSN                     equ 0000h
CCPTMRS1_C4TSEL_POSITION                 equ 0000h
CCPTMRS1_C4TSEL_SIZE                     equ 0002h
CCPTMRS1_C4TSEL_LENGTH                   equ 0002h
CCPTMRS1_C4TSEL_MASK                     equ 0003h
CCPTMRS1_C5TSEL0_POSN                    equ 0002h
CCPTMRS1_C5TSEL0_POSITION                equ 0002h
CCPTMRS1_C5TSEL0_SIZE                    equ 0001h
CCPTMRS1_C5TSEL0_LENGTH                  equ 0001h
CCPTMRS1_C5TSEL0_MASK                    equ 0004h
CCPTMRS1_C6TSEL0_POSN                    equ 0004h
CCPTMRS1_C6TSEL0_POSITION                equ 0004h
CCPTMRS1_C6TSEL0_SIZE                    equ 0001h
CCPTMRS1_C6TSEL0_LENGTH                  equ 0001h
CCPTMRS1_C6TSEL0_MASK                    equ 0010h
CCPTMRS1_C7TSEL_POSN                     equ 0006h
CCPTMRS1_C7TSEL_POSITION                 equ 0006h
CCPTMRS1_C7TSEL_SIZE                     equ 0002h
CCPTMRS1_C7TSEL_LENGTH                   equ 0002h
CCPTMRS1_C7TSEL_MASK                     equ 00C0h
CCPTMRS1_C4TSEL0_POSN                    equ 0000h
CCPTMRS1_C4TSEL0_POSITION                equ 0000h
CCPTMRS1_C4TSEL0_SIZE                    equ 0001h
CCPTMRS1_C4TSEL0_LENGTH                  equ 0001h
CCPTMRS1_C4TSEL0_MASK                    equ 0001h
CCPTMRS1_C4TSEL1_POSN                    equ 0001h
CCPTMRS1_C4TSEL1_POSITION                equ 0001h
CCPTMRS1_C4TSEL1_SIZE                    equ 0001h
CCPTMRS1_C4TSEL1_LENGTH                  equ 0001h
CCPTMRS1_C4TSEL1_MASK                    equ 0002h
CCPTMRS1_C7TSEL0_POSN                    equ 0006h
CCPTMRS1_C7TSEL0_POSITION                equ 0006h
CCPTMRS1_C7TSEL0_SIZE                    equ 0001h
CCPTMRS1_C7TSEL0_LENGTH                  equ 0001h
CCPTMRS1_C7TSEL0_MASK                    equ 0040h
CCPTMRS1_C7TSEL1_POSN                    equ 0007h
CCPTMRS1_C7TSEL1_POSITION                equ 0007h
CCPTMRS1_C7TSEL1_SIZE                    equ 0001h
CCPTMRS1_C7TSEL1_LENGTH                  equ 0001h
CCPTMRS1_C7TSEL1_MASK                    equ 0080h

// Register: CCPTMRS0
#define CCPTMRS0 CCPTMRS0
CCPTMRS0                                 equ 0F52h
// bitfield definitions
CCPTMRS0_C1TSEL_POSN                     equ 0000h
CCPTMRS0_C1TSEL_POSITION                 equ 0000h
CCPTMRS0_C1TSEL_SIZE                     equ 0003h
CCPTMRS0_C1TSEL_LENGTH                   equ 0003h
CCPTMRS0_C1TSEL_MASK                     equ 0007h
CCPTMRS0_C2TSEL_POSN                     equ 0003h
CCPTMRS0_C2TSEL_POSITION                 equ 0003h
CCPTMRS0_C2TSEL_SIZE                     equ 0003h
CCPTMRS0_C2TSEL_LENGTH                   equ 0003h
CCPTMRS0_C2TSEL_MASK                     equ 0038h
CCPTMRS0_C3TSEL_POSN                     equ 0006h
CCPTMRS0_C3TSEL_POSITION                 equ 0006h
CCPTMRS0_C3TSEL_SIZE                     equ 0002h
CCPTMRS0_C3TSEL_LENGTH                   equ 0002h
CCPTMRS0_C3TSEL_MASK                     equ 00C0h
CCPTMRS0_C1TSEL0_POSN                    equ 0000h
CCPTMRS0_C1TSEL0_POSITION                equ 0000h
CCPTMRS0_C1TSEL0_SIZE                    equ 0001h
CCPTMRS0_C1TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C1TSEL0_MASK                    equ 0001h
CCPTMRS0_C1TSEL1_POSN                    equ 0001h
CCPTMRS0_C1TSEL1_POSITION                equ 0001h
CCPTMRS0_C1TSEL1_SIZE                    equ 0001h
CCPTMRS0_C1TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C1TSEL1_MASK                    equ 0002h
CCPTMRS0_C1TSEL2_POSN                    equ 0002h
CCPTMRS0_C1TSEL2_POSITION                equ 0002h
CCPTMRS0_C1TSEL2_SIZE                    equ 0001h
CCPTMRS0_C1TSEL2_LENGTH                  equ 0001h
CCPTMRS0_C1TSEL2_MASK                    equ 0004h
CCPTMRS0_C2TSEL0_POSN                    equ 0003h
CCPTMRS0_C2TSEL0_POSITION                equ 0003h
CCPTMRS0_C2TSEL0_SIZE                    equ 0001h
CCPTMRS0_C2TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C2TSEL0_MASK                    equ 0008h
CCPTMRS0_C2TSEL1_POSN                    equ 0004h
CCPTMRS0_C2TSEL1_POSITION                equ 0004h
CCPTMRS0_C2TSEL1_SIZE                    equ 0001h
CCPTMRS0_C2TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C2TSEL1_MASK                    equ 0010h
CCPTMRS0_C2TSEL2_POSN                    equ 0005h
CCPTMRS0_C2TSEL2_POSITION                equ 0005h
CCPTMRS0_C2TSEL2_SIZE                    equ 0001h
CCPTMRS0_C2TSEL2_LENGTH                  equ 0001h
CCPTMRS0_C2TSEL2_MASK                    equ 0020h
CCPTMRS0_C3TSEL0_POSN                    equ 0006h
CCPTMRS0_C3TSEL0_POSITION                equ 0006h
CCPTMRS0_C3TSEL0_SIZE                    equ 0001h
CCPTMRS0_C3TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C3TSEL0_MASK                    equ 0040h
CCPTMRS0_C3TSEL1_POSN                    equ 0007h
CCPTMRS0_C3TSEL1_POSITION                equ 0007h
CCPTMRS0_C3TSEL1_SIZE                    equ 0001h
CCPTMRS0_C3TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C3TSEL1_MASK                    equ 0080h

